#include <stdio.h>
int main()
{
    int c[4][5] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20};
    int(*cp)[5]; // cp是一个指向包含5个元素的一维数组的指针,指向的空间大小为5*4=20字节
    cp = c;
    printf("%p\n", cp); // cp是c的地址,即c[0]的地址
    printf("%p\n", &c[0]);     // &c[0]是c[0]的地址
    printf("%p\n", cp + 1);    // cp+1是cp的地址+20字节,即c[1]的地址
    printf("%p\n", &c[1]);     //&c[1]是c[1]的地址
    printf("%p\n", c[1]);      // c[1]是c[1][0]的地址
    printf("%d\n", *c[1]);     // *c[1]是c[1][0]的值:6
    printf("%p\n", *(cp + 3)); // cp+3是cp的地址+3*20字节,即c[3]的地址,也就是说,*(cp+3)是c[3][0]的地址
    printf("%p\n", &c[3]);
    printf("%p\n", c[3]);
    printf("%d\n", *c[3]);      // *c[3]是c[3][0]的值:16
    printf("%d\n", **(cp + 3)); //**(cp+3)是c[3][0]的值:16

    printf("%p\n", *(cp + 1) + 3);    //*(cp + 1)是c[1][0]的地址,加3是c[1][3]的地址
    printf("%p\n", &c[1][3]);         //&c[1][3]是c[1][3]的地址
    printf("%d\n", c[1][3]);          // c[1][3]的值:9
    printf("%d\n", *(*(cp + 1) + 3)); //*(*(cp + 1)+ 3)是c[1][3]的值:9
    printf("%d\n", *(*cp + 2));       // *cp是c[0][0]的地址,所以(*cp+2)是c[0][2]的地址,*(*cp+2)是c[0][2]的值:3
    printf("%p\n", &c[0][0]);         //&c[0][0]是c[0][0]的地址
    printf("%d\n", c[0][2]);          // c[0][2]的值:3
    return 0;
}