/*
 * 例程 ID：EX-C06-002
 * 标题：教材例程 6.2
 * 教材位置：第 6 章 / 6.2
 * 知识点：一维数组、二维数组、字符数组、字符串
 * 来源：2024-2025-1/20241025_1029/6.2.c
 * 编译模式：c11-strict
 * 旧语法：无
 * 交互方式：manual
 * 兼容性：可移植例程：按 C11 子集验证。
 */
#include <stdio.h>
int main()
{
    int i;
    int f[20] = {1, 1}; // 对最前面两个元素f[0]和f[1]赋初值1
    for (i = 2; i < 20; i++)
        f[i] = f[i - 2] + f[i - 1]; // 先后求出f[2]~f[19]的值
    for (i = 0; i < 20; i++)
    {
        if (i % 5 == 0)
            printf("\n");     // 控制每输出5个数后换行
        printf("%12d", f[i]); // 输出一个数
    }
    printf("\n");
    return 0;
}
